In [4]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
%matplotlib inline

In [6]:
dataList = []
data = open("total-and-daily-cases-covid-19.csv") 
for i in data:
    dataList.append(i)

In [7]:
#index with same value
d = pd.DataFrame([['JOhn'], ["User"], ["Sam"]] , index = [4, 3,4])
d

      0
4  JOhn
3  User
4   Sam

In [8]:
#access same index will give all the values with the given index
d[0][4]

4    JOhn
4     Sam
Name: 0, dtype: object

In [9]:
df = pd.read_csv("datasets/time_series_covid19_confirmed_global.csv")
df.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,4/6/20,4/7/20,4/8/20,4/9/20,4/10/20,4/11/20,4/12/20,4/13/20,4/14/20,4/15/20
0,NaN,Afghanistan,33.0000,65.0000,0,0,0,0,0,0,...,367,423,444,484,521,555,607,665,714,784
1,NaN,Albania,41.1533,20.1683,0,0,0,0,0,0,...,377,383,400,409,416,433,446,467,475,494
2,NaN,Algeria,28.0339,1.6596,0,0,0,0,0,0,...,1423,1468,1572,1666,1761,1825,1914,1983,2070,2160
3,NaN,Andorra,42.5063,1.5218,0,0,0,0,0,0,...,525,545,564,583,601,601,638,646,659,673
4,NaN,Angola,-11.2027,17.8739,0,0,0,0,0,0,...,16,17,19,19,19,19,19,19,19,19

In [10]:
df.shape

(264, 89)

In [11]:
#rename a column
df = df.rename(columns={"Country/Region":"Country"})
df = df.rename(columns={"Province/State":"State"})
#outer bracket: indexing into DataFrame/ Series
#inner bracket: using python list to select multiple datas
df[["Country","State"]].tail()

                   Country                      State
259                 France  Saint Pierre and Miquelon
260            South Sudan                        NaN
261         Western Sahara                        NaN
262  Sao Tome and Principe                        NaN
263                  Yemen                        NaN

In [12]:
#DataFrame Slicing
df[200:205][["Country","State", "4/15/20"]]

          Country State  4/15/20
200  South Africa   NaN     2506
201         Spain   NaN   177644
202     Sri Lanka   NaN      238
203         Sudan   NaN       32
204      Suriname   NaN       10

In [13]:
#using loc and iloc

In [16]:
dft = pd.DataFrame([
    ["Texas",43567 , 34.2],
    ["Mississipi", 2323,10.8],
    ["Newyork",45697,40.9 ],
    ["Hawai",1234,5.9 ],
    ["Olympia",2222,9.5 ],
    ["Colorado", 3457,12.4]    
],
index= ["Austin","Jackson","Albany", "Honolulu","Washington","Denver"],
columns = ["State", "Population", "Percentage"])

In [17]:
dft

                 State  Population  Percentage
Austin           Texas       43567        34.2
Jackson     Mississipi        2323        10.8
Albany         Newyork       45697        40.9
Honolulu         Hawai        1234         5.9
Washington     Olympia        2222         9.5
Denver        Colorado        3457        12.4

In [23]:
# loc retrives data using label where as iloc retirves data using position
# slicling data and fetch single column
dft.loc["Honolulu":"Denver", "Population"]
#data slicing with multiple column. 
# in other case: dft["Honolulu":"Denver"]["State","Population"]
dft.loc["Honolulu":"Denver", ["State","Population"]]
# fetch all columns
dft.loc["Honolulu":"Denver"]

               State  Population  Percentage
Honolulu       Hawai        1234         5.9
Washington   Olympia        2222         9.5
Denver      Colorado        3457        12.4

In [25]:
# loc and iloc allows you to selcted rows, columns or single cell data in a single operation
# get all rows and column 2
dft.iloc[: , 2]

Austin        34.2
Jackson       10.8
Albany        40.9
Honolulu       5.9
Washington     9.5
Denver        12.4
Name: Percentage, dtype: float64

In [26]:
# returns a list of boolean with value depending on the given condition
dft['Percentage'] < 20

Austin        False
Jackson        True
Albany        False
Honolulu       True
Washington     True
Denver         True
Name: Percentage, dtype: bool

In [27]:
# gives rows that satisfies the given condition
dft[dft['Percentage'] < 20]

                 State  Population  Percentage
Jackson     Mississipi        2323        10.8
Honolulu         Hawai        1234         5.9
Washington     Olympia        2222         9.5
Denver        Colorado        3457        12.4

In [28]:
# Updating records
dft.loc[["Honolulu" , "Denver"],"Percentage"] +=3

In [32]:
dft.loc[["Honolulu", "Denver"],:]

             State  Population  Percentage
Honolulu     Hawai        1234         8.9
Denver    Colorado        3457        15.4

In [35]:
grades = pd.DataFrame([[6,4],[7,5],[2,4],[8,9],[5,8]],
                      index = ["Mary", "John", "Sam", "Simon", "Alex"],
                      columns = ["test1", "test2"])
grades

       test1  test2
Mary       6      4
John       7      5
Sam        2      4
Simon      8      9
Alex       5      8

In [37]:
# gives average of each column by default
grades.mean()

test1    5.6
test2    6.0
dtype: float64

In [39]:
# pass axis = 1 which gives mean of each row
grades.mean(axis = 1) > 5

Mary     False
John      True
Sam      False
Simon     True
Alex      True
dtype: bool

In [40]:
# create a new column 
grades['Passed'] = grades.mean(axis = 1) > 5

In [48]:
# Sorting with index but the original df is not sorted
grades.sort_index()

# to sort original df use 
grades.sort_index(inplace = True , ascending = False)

In [50]:
# sort with column
dft.sort_index(axis = 1)

            Percentage  Population       State
Austin            34.2       43567       Texas
Jackson           10.8        2323  Mississipi
Albany            40.9       45697     Newyork
Honolulu           8.9        1234       Hawai
Washington         9.5        2222     Olympia
Denver            15.4        3457    Colorado

In [55]:
# sort with values
dft.sort_values(by=["Percentage", "Population"] )

                 State  Population  Percentage
Honolulu         Hawai        1234         8.9
Washington     Olympia        2222         9.5
Jackson     Mississipi        2323        10.8
Denver        Colorado        3457        15.4
Austin           Texas       43567        34.2
Albany         Newyork       45697        40.9